{
  "agenda": {
    "day1": [
      { "id": 1, "label": "9h00" },
      { "id": 2, "label": "9h15" },
      { "id": 3, "label": "9h40" },
      { "id": 41, "label": "10h05" },
      { "id": 42, "label": "10h30" },
      { "id": 5, "label": "10h50" },
      { "id": 6, "label": "11h15" },
      { "id": 7, "label": "11h40" },
      { "id": 8, "label": "12h05" },
      { "id": 9, "label": "12h30" },
      { "id": 10, "label": "14h00" },
      { "id": 11, "label": "14h25" },
      { "id": 12, "label": "14h50" },
      { "id": 13, "label": "15h15" },
      { "id": 14, "label": "15h40" },
      { "id": 15, "label": "16h00" },
      { "id": 16, "label": "16h15" },
      { "id": 17, "label": "16h40" },
      { "id": 18, "label": "17h05" },
      { "id": 19, "label": "17h30" }
    ]
  },
  "sessions": [
    {
      "id": 1,
      "name": "Ouverture des portes",
      "image": "/images/agenda/open.png",
      "track": "Technozaure",
      "agenda": { "day": 1, "hour": 1 }
    },
    {
      "id": 9,
      "name": "Déjeuner",
      "type": "repas",
      "image": "/images/agenda/eat.png",
      "track": "Technozaure",
      "agenda": { "day": 1, "hour": 9 }
    },
    {
      "id": 5,
      "name": "Pause",
      "type": "café",
      "image": "/images/agenda/coffee.png",
      "agenda": { "day": 1, "hour": 5 }
    },
    {
      "id": 15,
      "name": "Pause",
      "type": "café",
      "image": "/images/agenda/coffee.png",
      "agenda": { "day": 1, "hour": 15 }
    },
    {
      "id": 19,
      "name": "Fin de la journée",
      "type": "after",
      "track": "Technozaure",
      "image": "/images/agenda/after.png",
      "agenda": { "day": 1, "hour": 19 }
    },
    {
      "id": 2,
      "name": "Rendez votre service mesh intelligent avec Istio",
      "description": "<p>Le déploiement d’une architecture microservice en production pose de nombreuses questions. Comment gérer la découverte des services? Comment gérer le load balancing? Comment gérer les erreurs?<br><br>L’approche traditionnelle est celle du “smart endpoints and dumb pipes” énoncée par Martin Fowler et selon laquelle ces problématiques doivent êtres gérées par les microservices eux même. Par exemple on va utiliser Hystrix comme circuit breaker dans les services java mais comment faire si un service est écrit en Ruby et ne dispose pas de librairie équivalente?<br><br>Istio propose de rendre nos tuyaux intelligents tout en gardant la configuration au plus près de nos services.</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "cloud",
      "speaker": [61, 74],
      "agenda": { "day": 1, "hour": 2 }
    },
    {
      "id": 3,
      "name": "Sketching the world",
      "description": "<p>Dans la série \"Les outils de l'UX designer\", je vous propose une rapide présentation d'Axure. Ce sera l’occasion de construire un petit prototype fonctionnel... sans aucune ligne de code !</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "discovery",
      "speaker": [75],
      "agenda": { "day": 1, "hour": 3 }
    },
    {
      "id": 41,
      "name": "Programmation réactive et Reactor",
      "description": "<p>L'usage de nos applications web a changé (augmentation des transactions, gestion de notifications, ...). Dans ce contexte, comment améliorer l'expérience des utilisateurs tout en construisant un système robuste et flexible ?<br><br>La programmation réactive est l'une des réponses. A travers ce quickie nous verrons les concepts de ce paradigme, puis côté Java, la spécification Reactive Streams ainsi qu'une de ses implémentations: Reactor de Pivotal.</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "web",
      "speaker": [76],
      "agenda": { "day": 1, "hour": 41 }
    },
    {
      "id": 42,
      "name": "\"PrismaPizza\", votre serveur GraphQL livré chez vous en moins de 20min",
      "description": "<p>Depuis quelques temps, on entend parler de GraphQL à toutes les sauces. Servi comme le remplaçant de REST, il nous tarde de goûter à ce langage.<br><br>Mais par quel bout commencer ? Ensemble, nous découvrirons comment utiliser Prisma et Yoga pour mettre en place un serveur GraphQL et le relier à votre base de donnée plus rapidement qu'une livraison Domino's.<br><br>Pour pimenter le tout, nous développerons le serveur d'une application de commande de Pizza en livecode durant ce talk.<br><br>Vous êtes prêt ? Alors allons-y, on a du pain sur la planche !</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "web",
      "speaker": [68],
      "agenda": { "day": 1, "hour": 42 }
    },
    {
      "id": 6,
      "name": "Elixir : qui a dit que disponibilité rimait avec complexité ?",
      "description": "<p>Aujourd'hui, la disponibilité des systèmes est devenue une des principales préoccupation lors de leur conception. Si les microservices sont une solution à ce problème, Erlang, développé par Ericson dans la fin des années 80, n'a pas grand-chose à leur envier.<br><br>Elixir est tout simplement l'Erlang des temps modernes. Au programme : programmation fonctionnelle, modèle acteur et supervision.</p>",
      "references": null,
      "difficulty": 1,
      "type": "quickie",
      "track": "cloud",
      "speaker": [57, 77],
      "agenda": { "day": 1, "hour": 6 }
    },
    {
      "id": 7,
      "name": "Dérouiller le Web avec Rust et WASM",
      "description": "<p>Dans ce talk, je vais présenter comment utiliser le language Rust et WebAssembly pour réaliser des applications webs qui vont plus vite que la lumière !</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "web",
      "speaker": [78],
      "agenda": { "day": 1, "hour": 7 }
    },
    {
      "id": 8,
      "name": "Ok Google, is my tram ready yet?",
      "description": "<p>J'habite dans un immeuble juste en face d'un arrêt de tram : je peux le voir depuis mon salon. A chaque fois que je dois descendre prendre le tram, je me pose une question : Quand est-ce que le prochain tram arrive ?<br><br>Je n'ai pas une vue de sentinelle et j'ai le réflexe de penser très fort : Ok google, quand est-ce que le tram arrive ? ...<br><br>Au bout de plusieurs fois, j'ai décidé de me lancer dans l'écriture d'un assistant google qui répondrait à mon besoin : ne pas attendre dehors alors que je peux rester tranquille chez moi et sortir au bon moment !<br><br>Alors, est-ce que mon tram est finalement prêt ?<br><br>Dans ce talk, je vous présente IMTRY mon projet du moment. Il s'agit d'un assistant google créé à l'aide de DialogFlow et déployé avec les CloudFunctions Firebase. Je m'appuie sur l'API temps réel de la Semitan (❤️Open Data Nantes)</p>",
      "difficulty": 2,
      "type": "quickie",
      "track": "mobile",
      "speaker": [63],
      "agenda": { "day": 1, "hour": 8 }
    },
    {
      "id": 10,
      "name": "Crafter un set d'armure rutilante !",
      "description": "<p>La nouvelle extension de World of Warcraft vient de sortir. Je n'y connais rien, je n'y joue pas. Mais peut-être y jouez-vous. Je vous propose l'exercice suivant. <br>Dans quelques semaines a lieu le premier affrontement Horde / Alliance. Il vous faut une armure complète prête pour ce combat exceptionnel. Construire et crafter une armure est un gros projet en soi. Voyons comment nous pouvons organiser notre projet pour être prêt à temps !<br><br>Dans ce court atelier vous allez m'aider à prouver qu'il y a de bonnes et de moins bonnes façons de gérer un projet en fonction du contexte. Ce n'est pas forcément trivial !</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "discovery",
      "speaker": [72, 73],
      "agenda": { "day": 1, "hour": 10 }
    },
    {
      "id": 11,
      "name": "Jouons avec Skaffold & Container Structure Test",
      "description": "<p>Vous développez des images Docker ? Vous les déployez sur K8S ? Venez découvrir deux outils bien pratiques : Skaffold & Container Structure Test<br><br>L’un permet de valider vos images Docker tandis que l’autre permet de recharger votre cluster Kubernetes rapidement… à chaque sauvegarde par exemple.<br><br>Venez découvrir l’utilisation conjointe des ces 2 outils pour être plus productif au jour le jour.</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "cloud",
      "speaker": [2],
      "agenda": { "day": 1, "hour": 11 }
    },
    {
      "id": 12,
      "name": "Out of the Tar Pit",
      "description": "<p>La gangrène de notre industrie c'est la complexité.<br><br>\"Out of the Tar Pit\" est un papier publié en 2006 qui s'attaque à l'étude de ce problème. Les auteurs y classifient les différents types de complexités et leurs causes, puis propose une architecture pour tenter de les contenir. Je vous propose de vous résumer le papier autour d'un exemple d'application, et d'explorer comment on pourrait se rapprocher de l'idéal du papier avec des technologies actuelles.<br><br>Avec Simple Made Easy que je vous ai présenté en septembre 2017, Out of the Tar Pit est une des influences majeures sur mon style de programmation.</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "discovery",
      "speaker": [31],
      "agenda": { "day": 1, "hour": 12 }
    },
    {
      "id": 13,
      "name": "Premiers pas avec AWS",
      "description": "J'explique la mise en oeuvre chez mon client actuel d'une infra AWS from scratch avec Terraform et un peu de shell pour aller du commit à la prod en passant dans des Review App avec Gitlab. L'appli est composée d'un front en React avec Gatsby accompagnée de plusieurs back en Node et SpringBoot. L'ensemble est déployé sur du S3 avec un CDN en frontal et ECS pour la partie Docker.",
      "difficulty": 1,
      "type": "quickie",
      "track": "cloud",
      "speaker": [50],
      "agenda": { "day": 1, "hour": 13 }
    },
    {
      "id": 14,
      "name": "Quand L'IA fait le job !",
      "description": "<p><b>L'Intelligence Artificielle</b> est au coeur des préoccupations dans le monde d'aujourd'hui.<br><br>Source de frayeurs pour les uns et d'espoirs pour les autres, fort de son couplage à la révolution numérique que nous vivons , il devient évident que son impact sociétal va boulverser nos vies dans les prochaines années.<br><br>Dressons un rapide panaroma, quels sont les domaines qu'elle va \"disrupter\" (santé , éducation , transports, agriculture, ...) et imaginons les conséquences sur le travail pour les Femmes et les Hommes du 21 ème siècle.</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "discovery",
      "speaker": [54],
      "agenda": { "day": 1, "hour": 14 }
    },
    {
      "id": 16,
      "name": "La face cachée des Devtools",
      "description": "<p>Les Devtools de Chrome proposent aux développeurs frontend une boîte à outil aujourd'hui quasi indispensable pour réaliser une application web. Mais la plupart des développeurs (et moi-même) nous les utilisons a 10% de leur capacité.<br><br>Dans ce quickie nous verrons les fonctionnalités sous utilisées, des astuces afin d'être efficaces et leur fonctionnement interne.<br><br>Après ce talk vous ne serez plus l.e.a même développeu.r.se Front :)</p>",
      "difficulty": 1,
      "type": "quickie",
      "track": "web",
      "speaker": [12],
      "agenda": { "day": 1, "hour": 16 }
    },
    {
      "id": 17,
      "name": "L'importance de la communication non-verbale",
      "description": "« Il m’a fait mauvaise impression, je sais pas pourquoi... » « Dans quel état d’esprit est mon interlocuteur ? » « C’est pourtant intéressant ce qu’il dit, pourquoi je m’ennuie autant ? » « Je ne le sens pas, celui-là… » « Ce type a un de ces charismes !!! » « Et moi, quelle image je donne vu de l’extérieur ? »<br><br>Que vous soyez speaker, formateur, recruteur, quelques notions de communication non-verbale pourront vous donner des clés pour décrypter les autres et vous-même !<br><br>(Avec de vrais exemples joués par un vrai acteur !)",
      "difficulty": 1,
      "type": "quickie",
      "track": "web",
      "speaker": [73],
      "agenda": { "day": 1, "hour": 17 }
    },
    {
      "id": 18,
      "name": "3 techniques de manipulation facile",
      "description": "En 20min je vous apprends trois techniques de manipulation pour influencer les gens qui vous entourent et ne pas vous faire influencer facilement.",
      "difficulty": 1,
      "type": "quickie",
      "track": "discovery",
      "speaker": [66],
      "agenda": { "day": 1, "hour": 18 }
    }
  ],
  "speakers": [
    {
      "id": 12,
      "firstname": "Benjamin",
      "name": "Petetot",
      "company": null,
      "bio": "",
      "photo": "bpetetot.jpg",
      "social": {},
      "sessions": [16]
    },
    {
      "id": 13,
      "firstname": "Antoine",
      "name": "Bonneau",
      "company": null,
      "bio": "",
      "photo": "abonneau.jpg",
      "social": {},
      "sessions": [8]
    },
    {
      "id": 14,
      "firstname": "Valentin",
      "name": "Ménard",
      "company": null,
      "bio": "",
      "photo": "vmenard.jpg",
      "social": {},
      "sessions": []
    },
    {
      "id": 50,
      "firstname": "Guillaume",
      "name": "Membré",
      "company": null,
      "bio": "Geek à toute heure, Guillaume Membré travaille principalement autour des technologies Java/JavaEE mais aussi sur des problématiques d'intégration continue, de qualimétrie. Mission après mission sur Nantes, il a eu l'occasion d'avoir une expérience diversifiée qui l'a amenée à occuper différentes responsabilités, à faire dèv et de l'infra, et maintenant de la mise en place d'outils devops.",
      "photo": "gmembre.jpg",
      "social": {
        "twitter": "@GuillaumeMembre",
        "googleplus": null,
        "github": null,
        "blog": "http://www.monbook.tech"
      },
      "sessions": [13]
    },
    {
      "id": 31,
      "firstname": "Hugo",
      "name": "Wood",
      "company": null,
      "bio": "Développeur autodidacte depuis 12 ans, professionnel depuis 3, je n'ai de cesse d'apprendre de nouvelles techniques pour améliorer mon savoir-faire. J'aime étudier les langages, de C# à Haskell. Au quotidien, ce sont Java et JavaScript qui m'accaparent. Je suis consultant et formateur chez Zenika. Enfin, j'apprécie les jeux de code : vous me retrouverez par exemple sur CodinGame, et là, c'est Python.",
      "photo": "hwood.jpg",
      "social": {
        "twitter": "@mercury_wood",
        "googleplus": null,
        "github": "hgwood"
      },
      "sessions": [12]
    },
    {
      "id": 5,
      "firstname": "Nicolas",
      "name": "Lepage",
      "company": null,
      "bio": "",
      "photo": "nlepage.jpg",
      "social": {
        "twitter": null,
        "googleplus": null,
        "github": null
      },
      "sessions": []
    },
    {
      "id": 7,
      "firstname": "Mathias",
      "name": "Bernardeau",
      "company": null,
      "bio": "",
      "photo": "mbernardeau.jpg",
      "social": {
        "twitter": null,
        "googleplus": null,
        "github": null,
        "linkedin": null
      },
      "sessions": []
    },
    {
      "id": 9,
      "firstname": "Benjamin",
      "name": "Fontaine",
      "company": null,
      "bio": "Je suis un dév fullstack Java et Js, curieux de tout : devops, nouvelles technologies, agilité, craftmanship, développement personnel.",
      "photo": "bfontaine.jpg",
      "social": {
        "twitter": "@benjifontaine5",
        "googleplus": "https://plus.google.com/100218727706940554885",
        "github": "https://github.com/benjaminfontaine"
      },
      "sessions": []
    },
    {
      "id": 6,
      "firstname": "Fabien",
      "name": "Juif",
      "company": null,
      "bio": "Fabien JUIF a baigné dans l’informatique depuis son adolescence. Il installait sa première Gentoo stage 1 en 1ère pour migrer vers Archlinux quelques années après.<br />Pour lui pacman n’est pas un jeu, on ne rigole pas avec ça.<br /><br />Passioné par la création de jeux vidéos, il s’intéressa très rapidement au développement logiciel. Avec 6 années dans le métier et une veille technologique personnelle depuis son plus jeune âge, il est devenu un peu touche à tout <i>GNU+Linux, Docker, développement backend, développement frontend, etc</i><br /><br />Chez Zenika, son attrait du moment c'est le Web, et plus précisément le développement ReactJS.<br /><br />Il espère pouvoir partager un peu de sa passion avec vous !",
      "photo": "fjuif.png",
      "social": {
        "twitter": null,
        "googleplus": null,
        "github": "fabienjuif"
      },
      "sessions": [5, 14]
    },
    {
      "id": 11,
      "firstname": "Yvonnick",
      "name": "Frin",
      "company": null,
      "bio": "Yvonnick développeur javascript chez Zenika Nantes. Curieux et passionné, il aime découvrir les dernières technologies du Web. Adepte d’AngularJs depuis déjà deux ans, il se met à explorer le Flux avec React. Social, il écume les meetups nantais en quête de nouveautés.",
      "photo": "yfrin.jpg",
      "social": {
        "twitter": "@YvonnickFrin",
        "googleplus": null,
        "github": "https://github.com/frinyvonnick"
      },
      "sessions": [13]
    },
    {
      "id": 32,
      "firstname": "Antoine",
      "name": "Cellier",
      "company": null,
      "bio": "Consultant chez Zenika Nantes. J'interviens sur des missions de réalisation autour des technos front et back tel que AngularJS, ReactJS et Spring. Passionné par l’écosystème technique dans lequel je travaille je participe régulièrement aux meetups Nantais et donne des talks lors de différents événement (NantesJS, Voxxed Luxembourg, Nantes JUG, bdx.io)",
      "photo": "acellier.jpg",
      "social": {
        "twitter": "@AntoineCellier3",
        "googleplus": null,
        "blog": null,
        "github": null,
        "linkedin": "https://www.linkedin.com/in/antoine-cellier-34b69954"
      },
      "sessions": [2]
    },
    {
      "id": 51,
      "firstname": "Eric",
      "name": "Briand",
      "company": null,
      "bio": "Eric développeur Java/J2EE full-stack chez Zenika Nantes. Il aime travailler sur toutes les couches d'une application web, de la base de données jusqu'au front en utilisant aussi bien des technologies qui ont fait leur preuve que des technologies de pointe. Très intéressé par les technologies Cloud (PAAS & IAAS). Il est formateur officiel Docker et co-organisateur du Docker Meetup Nantes.",
      "photo": "ebriand.jpg",
      "social": {
        "twitter": "@eric_briand",
        "googleplus": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [3]
    },
    {
      "id": 2,
      "firstname": "Julien",
      "name": "Landuré",
      "company": null,
      "bio": "CTO de Zenika Nantes, Julien navigue entre des missions de formation (Docker, AngularJS, PaaS) et d’architecture. Issu de la génération Google, il a co-fondé en Janvier 2011 le GDG Nantes, participe depuis 5 ans au Google I/O et organise le DevFest Nantes.",
      "photo": "jlandure.jpg",
      "social": {
        "twitter": "@jlandure",
        "googleplus": "https://plus.google.com/+JulienLandur%C3%A9",
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [11]
    },
    {
      "id": 52,
      "firstname": "Vickrame",
      "name": "Ujoodha",
      "company": null,
      "bio": "",
      "photo": "vujoodha.jpg",
      "social": {
        "twitter": "@Ruvachlea",
        "blog": null,
        "github": "vickrame",
        "linkedin": null
      },
      "sessions": [3]
    },
    {
      "id": 53,
      "firstname": "Franck",
      "name": "Abgrall",
      "company": null,
      "bio": "",
      "photo": "fabgrall.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [14]
    },
    {
      "id": 54,
      "firstname": "Vincent",
      "name": "Vimard",
      "company": null,
      "bio": "",
      "photo": "vvimard.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [14]
    },
    {
      "id": 55,
      "firstname": "Gregory",
      "name": "Bevan",
      "company": null,
      "bio": "",
      "photo": "gbevan.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [12]
    },
    {
      "id": 56,
      "firstname": "Amelin",
      "name": "Orenge",
      "company": null,
      "bio": "",
      "photo": "aorenge.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [8]
    },
    {
      "id": 57,
      "firstname": "Valentin",
      "name": "Cocaud",
      "company": null,
      "bio": "",
      "photo": "vcocaud.jpg",
      "social": {
        "twitter": "ragorn44",
        "blog": null,
        "github": "EmrysMyrddin",
        "linkedin": null
      },
      "sessions": [6]
    },
    {
      "id": 58,
      "firstname": "Maxime",
      "name": "Claveau",
      "company": null,
      "bio": "",
      "photo": "default.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": []
    },
    {
      "id": 59,
      "firstname": "Yoann",
      "name": "Prot",
      "company": null,
      "bio": "",
      "photo": "yprot.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [13]
    },
    {
      "id": 60,
      "firstname": "Thomas",
      "name": "Betous",
      "company": null,
      "bio": "",
      "photo": "tbetous.jpg",
      "social": {
        "twitter": "tbetous",
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [12]
    },
    {
      "id": 61,
      "firstname": "Pierre-Yves",
      "name": "Aillet",
      "company": null,
      "bio": "",
      "photo": "paillet.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [2]
    },
    {
      "id": 62,
      "firstname": "Delphine",
      "name": "Millet",
      "company": null,
      "bio": "",
      "photo": "dmillet.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [17]
    },
    {
      "id": 63,
      "firstname": "Charles-Henri",
      "name": "Guérin",
      "company": null,
      "bio": "",
      "photo": "cguerin.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [8]
    },
    {
      "id": 64,
      "firstname": "Florian",
      "name": "Nègre",
      "company": null,
      "bio": "",
      "photo": "fnegre.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [3]
    },
    {
      "id": 65,
      "firstname": "Emeric",
      "name": "Martineau",
      "company": null,
      "bio": "",
      "photo": "emartineau.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [12]
    },
    {
      "id": 66,
      "firstname": "Marie",
      "name": "Viley",
      "company": null,
      "bio": "",
      "photo": "mviley.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [18]
    },
    {
      "id": 67,
      "firstname": "Lucas",
      "name": "Dupuy",
      "company": null,
      "bio": "",
      "photo": "ldupuy.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [6]
    },
    {
      "id": 68,
      "firstname": "Thibaud",
      "name": "Courtoison",
      "company": null,
      "bio": "",
      "photo": "tcourtoison.png",
      "social": {
        "twitter": "@Errorname_",
        "blog": null,
        "github": "Errorname",
        "linkedin": null
      },
      "sessions": [42]
    },
    {
      "id": 69,
      "firstname": "Dylan",
      "name": "Duclos",
      "company": null,
      "bio": "",
      "photo": "dduclos.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [7]
    },
    {
      "id": 70,
      "firstname": "Olivier",
      "name": "Huber",
      "company": null,
      "bio": "",
      "photo": "ohuber.jpg",
      "social": {
        "twitter": null,
        "blog": null,
        "github": null,
        "linkedin": null
      },
      "sessions": [11]
    },
    {
      "id": 71,
      "firstname": "Patrice",
      "name": "De Saint Steban",
      "company": null,
      "bio": "Développeur FullStack depuis 8 ans, sur les technologies Java, Gwt, Angular, Ionic.",
      "photo": "pdesaintsteban.jpg",
      "social": {
        "twitter": "patoudss",
        "blog": null,
        "github": "patou",
        "linkedin": null
      },
      "sessions": [16]
    },
    {
      "id": 72,
      "firstname": "Johan",
      "name": "Bonneau",
      "company": null,
      "bio": "",
      "photo": "jbonneau.jpg",
      "social": {
        "twitter": "JohanBonneau",
        "blog": null,
        "github": "Zenigata",
        "linkedin": null
      },
      "sessions": [10]
    },
    {
      "id": 73,
      "firstname": "Séverine",
      "name": "Luzeau",
      "company": null,
      "bio": "",
      "photo": "sluzeau.jpg",
      "social": {
        "twitter": "",
        "blog": null,
        "github": "",
        "linkedin": null
      },
      "sessions": [10, 17]
    },
    {
      "id": 74,
      "firstname": "Vincent",
      "name": "Poilvert",
      "company": null,
      "bio": "",
      "photo": "vpoilvert.jpg",
      "social": {
        "twitter": "VincentPoilvert",
        "blog": null,
        "github": "vpoilvert",
        "linkedin": null
      },
      "sessions": [2]
    },
    {
      "id": 75,
      "firstname": "Stéphane",
      "name": "Cohan",
      "company": null,
      "bio": "",
      "photo": "scohan.jpg",
      "social": {
        "twitter": "SCxPro",
        "blog": "https://naoned-makers.github.io/",
        "github": "",
        "linkedin": null
      },
      "sessions": [3]
    },
    {
      "id": 76,
      "firstname": "Joanna",
      "name": "Cartron",
      "company": null,
      "bio": "",
      "photo": "jcartron.jpg",
      "social": {
        "twitter": "",
        "blog": null,
        "github": "",
        "linkedin": null
      },
      "sessions": [41]
    },
    {
      "id": 77,
      "firstname": "Pierre",
      "name": "Legall",
      "company": null,
      "bio": "",
      "photo": "plegall.png",
      "social": {
        "twitter": "lepieru",
        "blog": null,
        "github": "lepieru",
        "linkedin": null
      },
      "sessions": [6]
    },
    {
      "id": 78,
      "firstname": "Maël",
      "name": "Naccache",
      "company": null,
      "bio": "",
      "photo": "mnaccache.png",
      "social": {
        "twitter": "",
        "blog": null,
        "github": "maeln",
        "linkedin": null
      },
      "sessions": [7]
    }
  ]
}
